In [1]:
import pandas as pd
import datetime

## Sheet 1

In [2]:
df1=pd.read_excel("C:\\Users\\user\\Downloads\\4.MKR TASK 2\\Masterclass - The Basics Of Excel (Responses) (1).xlsx")
df1.head(10)

                Timestamp    First Name  Last Name         City  Unnamed: 4
0 2020-09-28 00:10:58.066      Pranshu   Bhatnagar    Moradabad         1.0
1 2020-09-28 07:17:13.080        Kumari     Garima        Delhi        35.0
2 2020-09-28 09:12:18.512  Damarakeswar   Guddanti        ELURU         1.0
3 2020-09-28 09:41:07.900        Manish     Bharti    Bangalore        17.0
4 2020-09-28 10:59:00.443        Rakesh   Tripathi         Pune        52.0
5 2020-09-28 20:28:11.425         Ajeet      Kumar   SONEBHADRA         1.0
6 2020-09-29 13:41:28.957        Aditya      Singh         Pune         NaN
7 2020-09-30 13:43:18.853        Shruti     Nagpal        Delhi         NaN
8 2020-09-30 13:47:03.209        Gaurav        Jha  Bhubaneswar         3.0
9 2020-09-30 14:52:25.604        Sairam     Muddam       Mumbai        48.0

In [3]:
df1.shape

(657, 5)

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 657 entries, 0 to 656
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Timestamp   657 non-null    datetime64[ns]
 1   First Name  657 non-null    object
 2   Last Name   657 non-null    object
 3   City        657 non-null    object
 4   Unnamed: 4  110 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 25.8+ KB

In [5]:
df1.columns = [c.replace(' ', '_') for c in df1.columns]

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 657 entries, 0 to 656
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Timestamp   657 non-null    datetime64[ns]
 1   First_Name  657 non-null    object
 2   Last_Name   657 non-null    object
 3   City        657 non-null    object
 4   Unnamed:_4  110 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 25.8+ KB

In [7]:
df1['Name']= df1['First_Name'] + ' ' + df1['Last_Name']

In [8]:
df1.drop(['First_Name','Last_Name','Unnamed:_4'], axis = 1, inplace=True)

In [9]:
Class = ['Excel' for i in range(len(df1))]
df1['Class'] = Class
df1.head()

                Timestamp       City                    Name  Class
0 2020-09-28 00:10:58.066  Moradabad      Pranshu  Bhatnagar  Excel
1 2020-09-28 07:17:13.080      Delhi           Kumari Garima  Excel
2 2020-09-28 09:12:18.512      ELURU  Damarakeswar  Guddanti  Excel
3 2020-09-28 09:41:07.900  Bangalore           Manish Bharti  Excel
4 2020-09-28 10:59:00.443       Pune         Rakesh Tripathi  Excel

## Sheet 2

In [10]:
df2=pd.read_excel("C:\\Users\\user\\Downloads\\4.MKR TASK 2\\_Masterclass on - Whatsapp Marketing (Responses).xlsx")
df2.head()

,Timestamp,First Name,Last Name,City,Unnamed: 4,Unnamed: 5
0,2020-08-29 11:31:02.261,Raj,Maru,Mumbai,whatsapp,whatsappRajMaru
1,2020-08-29 16:33:59.010,Prachi,Agarwal,Moradabad,whatsapp,whatsappPrachi Agarwal
2,2020-08-29 18:08:10.918,Paramananda,Deka,Guwahati,whatsapp,whatsappParamananda Deka
3,2020-08-29 19:36:26.061,Rajesh,Kumar,Raebareli,whatsapp,whatsappRajeshKumar
4,2020-08-29 19:40:57.353,Akanksha,Kunwar,Dehradun,whatsapp,whatsappAkanksha Kunwar

In [11]:
df2.columns = [c.replace(' ', '_') for c in df2.columns]
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 389 entries, 0 to 388
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Timestamp   389 non-null    datetime64[ns]
 1   First_Name  389 non-null    object
 2   Last_Name   389 non-null    object
 3   City        389 non-null    object
 4   Unnamed:_4  389 non-null    object
 5   Unnamed:_5  389 non-null    object
dtypes: datetime64[ns](1), object(5)
memory usage: 18.4+ KB

In [12]:
df2['Name']= df2['First_Name'] + ' ' + df2['Last_Name']

In [13]:
df2.drop(['First_Name','Last_Name','Unnamed:_4','Unnamed:_5'], axis = 1, inplace=True)

In [14]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 389 entries, 0 to 388
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  389 non-null    datetime64[ns]
 1   City       389 non-null    object
 2   Name       389 non-null    object
dtypes: datetime64[ns](1), object(2)
memory usage: 9.2+ KB

In [15]:
Class = ['Whatsapp Marketing' for i in range(len(df2))]
df2['Class'] = Class
df2.head()

                Timestamp        City               Name               Class
0 2020-08-29 11:31:02.261      Mumbai           Raj Maru  Whatsapp Marketing
1 2020-08-29 16:33:59.010  Moradabad    Prachi  Agarwal   Whatsapp Marketing
2 2020-08-29 18:08:10.918    Guwahati  Paramananda  Deka  Whatsapp Marketing
3 2020-08-29 19:36:26.061   Raebareli       Rajesh Kumar  Whatsapp Marketing
4 2020-08-29 19:40:57.353    Dehradun   Akanksha  Kunwar  Whatsapp Marketing

## Sheet 3

In [16]:
df3=pd.read_excel("C:\\Users\\user\\Downloads\\4.MKR TASK 2\\Public Speaking - Masterclass (Responses).xlsx")
df3.head()

,Timestamp,First Name,Last Name,City,Unnamed: 4,Unnamed: 5
0,2020-08-02 15:05:28.216,saket,deshmukh,Pune,Public,Publicsaketdeshmukh
1,2020-08-02 22:13:36.424,Mishika,Sharma,Gurgaon,Public,PublicMishikaSharma
2,2020-08-02 22:16:43.616,Diksha,Deb,"Silchar, Assam",Public,PublicDikshaDeb
3,2020-08-02 22:17:19.184,Lohith,Bollineni,Chennai,Public,PublicLohithBollineni
4,2020-08-02 22:20:47.635,Rutuja,Ghorpade,Pune,Public,PublicRutujaGhorpade

In [17]:
df3.columns = [c.replace(' ', '_') for c in df3.columns]
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Timestamp   195 non-null    datetime64[ns]
 1   First_Name  195 non-null    object
 2   Last_Name   195 non-null    object
 3   City        195 non-null    object
 4   Unnamed:_4  195 non-null    object
 5   Unnamed:_5  195 non-null    object
dtypes: datetime64[ns](1), object(5)
memory usage: 9.3+ KB

In [18]:
df3['Name']= df3['First_Name'] + ' ' + df3['Last_Name']

In [19]:
df3.drop(['First_Name','Last_Name','Unnamed:_4','Unnamed:_5'], axis = 1, inplace=True)

In [20]:
Class = ['Public Speaking' for i in range(len(df3))]
df3['Class'] = Class
df3.head()

                Timestamp            City              Name            Class
0 2020-08-02 15:05:28.216            Pune    saket deshmukh  Public Speaking
1 2020-08-02 22:13:36.424         Gurgaon    Mishika Sharma  Public Speaking
2 2020-08-02 22:16:43.616  Silchar, Assam        Diksha Deb  Public Speaking
3 2020-08-02 22:17:19.184         Chennai  Lohith Bollineni  Public Speaking
4 2020-08-02 22:20:47.635            Pune   Rutuja Ghorpade  Public Speaking

## Sheet 4

In [21]:
df4=pd.read_excel("C:\\Users\\user\\Downloads\\4.MKR TASK 2\\The Podcast - Masterclass (Responses).xlsx")
df4.head()

,Timestamp,First Name,Last Name,City,Unnamed: 4,Unnamed: 5
0,2020-08-14 07:58:54.049,JYOTI,GOSWAMI,Bikramganj,podcast,podcastJYOTIGOSWAMI
1,2020-08-14 09:31:51.186,Anil,Kumar,Arwal,podcast,podcastAnilKumar
2,2020-08-14 12:59:11.465,Sandhya,Shakya,Banglore,podcast,podcastSandhya Shakya
3,2020-08-14 15:23:18.877,Rajnish,Tomar,Delhi,podcast,podcastRajnishTomar
4,2020-08-14 16:21:04.926,Sheril,Gaikwad,Mumbai,podcast,podcastSheril Gaikwad

In [22]:
df4.columns = [c.replace(' ', '_') for c in df4.columns]
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 223 entries, 0 to 222
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Timestamp   223 non-null    datetime64[ns]
 1   First_Name  223 non-null    object
 2   Last_Name   223 non-null    object
 3   City        223 non-null    object
 4   Unnamed:_4  223 non-null    object
 5   Unnamed:_5  223 non-null    object
dtypes: datetime64[ns](1), object(5)
memory usage: 10.6+ KB

In [23]:
df4['Name']= df4['First_Name'] + ' ' + df4['Last_Name']

In [24]:
df4.drop(['First_Name','Last_Name','Unnamed:_4','Unnamed:_5'], axis = 1, inplace=True)

In [25]:
Class = ['Podcast' for i in range(len(df4))]
df4['Class'] = Class
df4.head()

                Timestamp        City              Name    Class
0 2020-08-14 07:58:54.049  Bikramganj     JYOTI GOSWAMI  Podcast
1 2020-08-14 09:31:51.186       Arwal        Anil Kumar  Podcast
2 2020-08-14 12:59:11.465    Banglore   Sandhya  Shakya  Podcast
3 2020-08-14 15:23:18.877       Delhi     Rajnish Tomar  Podcast
4 2020-08-14 16:21:04.926     Mumbai   Sheril  Gaikwad   Podcast

## Sheet 5

In [26]:
df5=pd.read_excel("C:\\Users\\user\\Downloads\\4.MKR TASK 2\\Masterclass - The Basics Of Digital Marketing (Responses).xlsx")
df5.head()

,Timestamp,First Name,Last Name,City,Unnamed: 4,Unnamed: 5
0,2020-09-19 16:30:06.460,Deepali,Vandana,Mumbai,DMC,DMCDeepaliVandana
1,2020-09-19 17:18:17.638,Supriya,Glory,Bangalore,DMC,DMCSupriya Glory
2,2020-09-19 19:29:09.356,Samiksha,Todaria,Dehradun,DMC,DMCSamikshaTodaria
3,2020-09-20 03:33:16.894,Ajay,Kushwaha,Maihar,DMC,DMCAjayKushwaha
4,2020-09-20 16:50:17.189,Divya Sai Teja,Sindiri,Visakhapatnam,DMC,DMCDivya Sai TejaSindiri

In [27]:
df5.columns = [c.replace(' ', '_') for c in df5.columns]
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Timestamp   244 non-null    datetime64[ns]
 1   First_Name  244 non-null    object
 2   Last_Name   244 non-null    object
 3   City        244 non-null    object
 4   Unnamed:_4  244 non-null    object
 5   Unnamed:_5  244 non-null    object
dtypes: datetime64[ns](1), object(5)
memory usage: 11.6+ KB

In [28]:
df5['Name']= df5['First_Name'] + ' ' + df5['Last_Name']

In [29]:
df5.drop(['First_Name','Last_Name','Unnamed:_4','Unnamed:_5'], axis = 1, inplace=True)

In [30]:
Class = ['Digital Marketing' for i in range(len(df5))]
df5['Class'] = Class
df5.head()

,Timestamp,City,Name,Class
0,2020-09-19 16:30:06.460,Mumbai,Deepali Vandana,Digital Marketing
1,2020-09-19 17:18:17.638,Bangalore,Supriya Glory,Digital Marketing
2,2020-09-19 19:29:09.356,Dehradun,Samiksha Todaria,Digital Marketing
3,2020-09-20 03:33:16.894,Maihar,Ajay Kushwaha,Digital Marketing
4,2020-09-20 16:50:17.189,Visakhapatnam,Divya Sai Teja Sindiri,Digital Marketing

## Sheet 6

In [31]:
df6=pd.read_excel("C:\\Users\\user\\Downloads\\4.MKR TASK 2\\Masterclass on Basics of Canva - a Graphic Design Platform (Responses).xlsx")
df6.head()

,Timestamp,First Name,Last Name,City,Unnamed: 4,Unnamed: 5
0,2020-08-09 21:10:59.330,Anuja,Kharkar,Bhopal,canva,canvaAnujaKharkar
1,2020-08-09 21:27:42.550,Abhishek,Bhardwaj,New delhi,canva,canvaAbhishek Bhardwaj
2,2020-08-09 21:29:55.608,Manjiri,Sonone,Pune,canva,canvaManjiriSonone
3,2020-08-09 21:30:34.752,Anthima,Singh,Hyderabad,canva,canvaAnthimaSingh
4,2020-08-09 21:36:48.633,Dharini,Shah,Mumbai,canva,canvaDhariniShah

In [32]:
df6.columns = [c.replace(' ', '_') for c in df6.columns]
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 666 entries, 0 to 665
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Timestamp   666 non-null    datetime64[ns]
 1   First_Name  666 non-null    object
 2   Last_Name   666 non-null    object
 3   City        666 non-null    object
 4   Unnamed:_4  666 non-null    object
 5   Unnamed:_5  666 non-null    object
dtypes: datetime64[ns](1), object(5)
memory usage: 31.3+ KB

In [33]:
df6['Name']= df6['First_Name'] + ' ' + df6['Last_Name']

In [34]:
df6.drop(['First_Name','Last_Name','Unnamed:_4','Unnamed:_5'], axis = 1, inplace=True)

In [35]:
Class = ['Canva' for i in range(len(df6))]
df6['Class'] = Class
df6.head()

                Timestamp        City                 Name  Class
0 2020-08-09 21:10:59.330      Bhopal        Anuja Kharkar  Canva
1 2020-08-09 21:27:42.550   New delhi  Abhishek  Bhardwaj   Canva
2 2020-08-09 21:29:55.608        Pune       Manjiri Sonone  Canva
3 2020-08-09 21:30:34.752  Hyderabad         Anthima Singh  Canva
4 2020-08-09 21:36:48.633      Mumbai         Dharini Shah  Canva

## Sheet 7

In [36]:
df7=pd.read_excel("C:\\Users\\user\\Downloads\\4.MKR TASK 2\\Basic Video Editing - Masterclass (Responses).xlsx")
df7.head()

                Timestamp         First Name      City Last Name Unnamed: 4
0 2020-07-28 16:46:31.177            Samrita    Raipur       NaN        NaN
1 2020-07-28 16:46:43.534     Khushi Tiwari   Gurgaon        NaN        NaN
2 2020-07-28 16:48:02.362      Shreya Biswas    Bhilai       NaN        NaN
3 2020-07-28 16:49:58.147       Hardik Patni      Pune       NaN        NaN
4 2020-07-28 16:50:17.182  Anhad Preet Singh   Chennai       NaN        NaN

In [37]:
df7.columns = [c.replace(' ', '_') for c in df7.columns]
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 586 entries, 0 to 585
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Timestamp   586 non-null    datetime64[ns]
 1   First_Name  586 non-null    object
 2   City        586 non-null    object
 3   Last_Name   205 non-null    object
 4   Unnamed:_4  115 non-null    object
dtypes: datetime64[ns](1), object(4)
memory usage: 23.0+ KB

In [38]:
df7.drop(['Unnamed:_4'], axis = 1, inplace=True)

In [39]:
df7.head()

                Timestamp         First_Name      City Last_Name
0 2020-07-28 16:46:31.177            Samrita    Raipur       NaN
1 2020-07-28 16:46:43.534     Khushi Tiwari   Gurgaon        NaN
2 2020-07-28 16:48:02.362      Shreya Biswas    Bhilai       NaN
3 2020-07-28 16:49:58.147       Hardik Patni      Pune       NaN
4 2020-07-28 16:50:17.182  Anhad Preet Singh   Chennai       NaN

In [40]:
df7.tail()

                  Timestamp   First_Name        City     Last_Name
581 2020-08-02 14:05:45.856      Kalyani        Pune           Jha
582 2020-08-02 20:13:55.905  Prathyusha   Kondapalli   Vangaveeti
583 2020-08-04 01:22:17.969    Munnawar         Pune  Nagarbawadi
584 2020-08-04 08:51:10.272       Souvik    Guwahati           das
585 2020-09-11 19:01:30.905        Manan        Pune      Sanghnai

In [41]:
Class = ['Video Editing' for i in range(len(df7))]
df7['Class'] = Class
df7.head()

,Timestamp,First_Name,City,Last_Name,Class
0,2020-07-28 16:46:31.177,Samrita,Raipur,NaN,Video Editing
1,2020-07-28 16:46:43.534,Khushi Tiwari,Gurgaon,NaN,Video Editing
2,2020-07-28 16:48:02.362,Shreya Biswas,Bhilai,NaN,Video Editing
3,2020-07-28 16:49:58.147,Hardik Patni,Pune,NaN,Video Editing
4,2020-07-28 16:50:17.182,Anhad Preet Singh,Chennai,NaN,Video Editing

In [42]:
df7['Name']= df7['First_Name'] + ' ' + df7['Last_Name']

In [43]:
df7.head()

,Timestamp,First_Name,City,Last_Name,Class,Name
0,2020-07-28 16:46:31.177,Samrita,Raipur,NaN,Video Editing,NaN
1,2020-07-28 16:46:43.534,Khushi Tiwari,Gurgaon,NaN,Video Editing,NaN
2,2020-07-28 16:48:02.362,Shreya Biswas,Bhilai,NaN,Video Editing,NaN
3,2020-07-28 16:49:58.147,Hardik Patni,Pune,NaN,Video Editing,NaN
4,2020-07-28 16:50:17.182,Anhad Preet Singh,Chennai,NaN,Video Editing,NaN

In [44]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 586 entries, 0 to 585
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Timestamp   586 non-null    datetime64[ns]
 1   First_Name  586 non-null    object
 2   City        586 non-null    object
 3   Last_Name   205 non-null    object
 4   Class       586 non-null    object
 5   Name        205 non-null    object
dtypes: datetime64[ns](1), object(5)
memory usage: 27.6+ KB

In [45]:
df7["Name"] = df7["Name"].fillna(df7["First_Name"])

In [46]:
df7.head()

,Timestamp,First_Name,City,Last_Name,Class,Name
0,2020-07-28 16:46:31.177,Samrita,Raipur,NaN,Video Editing,Samrita
1,2020-07-28 16:46:43.534,Khushi Tiwari,Gurgaon,NaN,Video Editing,Khushi Tiwari
2,2020-07-28 16:48:02.362,Shreya Biswas,Bhilai,NaN,Video Editing,Shreya Biswas
3,2020-07-28 16:49:58.147,Hardik Patni,Pune,NaN,Video Editing,Hardik Patni
4,2020-07-28 16:50:17.182,Anhad Preet Singh,Chennai,NaN,Video Editing,Anhad Preet Singh

In [47]:
df7.drop(['First_Name','Last_Name'], axis = 1, inplace=True)

In [48]:
df7.head()

                Timestamp      City          Class               Name
0 2020-07-28 16:46:31.177    Raipur  Video Editing            Samrita
1 2020-07-28 16:46:43.534  Gurgaon   Video Editing     Khushi Tiwari
2 2020-07-28 16:48:02.362    Bhilai  Video Editing      Shreya Biswas
3 2020-07-28 16:49:58.147      Pune  Video Editing       Hardik Patni
4 2020-07-28 16:50:17.182   Chennai  Video Editing  Anhad Preet Singh

In [49]:
cols=df7.columns.tolist()

In [50]:
cols[2],cols[3]=cols[3],cols[2]
cols

['Timestamp', 'City', 'Name', 'Class']

In [51]:
df7=df7[cols]
df7.head()

                Timestamp      City               Name          Class
0 2020-07-28 16:46:31.177    Raipur            Samrita  Video Editing
1 2020-07-28 16:46:43.534  Gurgaon      Khushi Tiwari   Video Editing
2 2020-07-28 16:48:02.362    Bhilai      Shreya Biswas  Video Editing
3 2020-07-28 16:49:58.147      Pune       Hardik Patni  Video Editing
4 2020-07-28 16:50:17.182   Chennai  Anhad Preet Singh  Video Editing

In [52]:
All_df=[df1,df2,df3,df4,df5,df6,df7]

In [53]:
df=pd.concat(All_df)

In [54]:
df

,Timestamp,City,Name,Class
0,2020-09-28 00:10:58.066,Moradabad,Pranshu Bhatnagar,Excel
1,2020-09-28 07:17:13.080,Delhi,Kumari Garima,Excel
2,2020-09-28 09:12:18.512,ELURU,Damarakeswar Guddanti,Excel
3,2020-09-28 09:41:07.900,Bangalore,Manish Bharti,Excel
4,2020-09-28 10:59:00.443,Pune,Rakesh Tripathi,Excel
...,...,...,...,...
581,2020-08-02 14:05:45.856,Pune,Kalyani Jha,Video Editing
582,2020-08-02 20:13:55.905,Kondapalli,Prathyusha Vangaveeti,Video Editing
583,2020-08-04 01:22:17.969,Pune,Munnawar Nagarbawadi,Video Editing
584,2020-08-04 08:51:10.272,Guwahati,Souvik das,Video Editing
585,2020-09-11 19:01:30.905,Pune,Manan Sanghnai,Video Editing

In [55]:
df['City']=df['City'].str.upper()

In [56]:
df.head()

                Timestamp       City                    Name  Class
0 2020-09-28 00:10:58.066  MORADABAD      Pranshu  Bhatnagar  Excel
1 2020-09-28 07:17:13.080      DELHI           Kumari Garima  Excel
2 2020-09-28 09:12:18.512      ELURU  Damarakeswar  Guddanti  Excel
3 2020-09-28 09:41:07.900  BANGALORE           Manish Bharti  Excel
4 2020-09-28 10:59:00.443       PUNE         Rakesh Tripathi  Excel

In [57]:
col=df.columns.tolist()

In [58]:
col[1],col[2]=col[2],col[1]

In [59]:
df=df[col]
df.head()

                Timestamp                    Name       City  Class
0 2020-09-28 00:10:58.066      Pranshu  Bhatnagar  MORADABAD  Excel
1 2020-09-28 07:17:13.080           Kumari Garima      DELHI  Excel
2 2020-09-28 09:12:18.512  Damarakeswar  Guddanti      ELURU  Excel
3 2020-09-28 09:41:07.900           Manish Bharti  BANGALORE  Excel
4 2020-09-28 10:59:00.443         Rakesh Tripathi       PUNE  Excel

In [60]:
df['Date'] = df['Timestamp'].dt.date

<ipython-input-60-360b569fc91e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Date'] = df['Timestamp'].dt.date

In [61]:
df.head()

,Timestamp,Name,City,Class,Date
0,2020-09-28 00:10:58.066,Pranshu Bhatnagar,MORADABAD,Excel,2020-09-28
1,2020-09-28 07:17:13.080,Kumari Garima,DELHI,Excel,2020-09-28
2,2020-09-28 09:12:18.512,Damarakeswar Guddanti,ELURU,Excel,2020-09-28
3,2020-09-28 09:41:07.900,Manish Bharti,BANGALORE,Excel,2020-09-28
4,2020-09-28 10:59:00.443,Rakesh Tripathi,PUNE,Excel,2020-09-28

In [62]:
col=df.columns.tolist()

In [63]:
col[0],col[4]=col[4],col[0]

In [64]:
df=df[col]
df.drop('Timestamp', axis = 1, inplace=True)

In [65]:
df.head()

         Date                    Name       City  Class
0  2020-09-28      Pranshu  Bhatnagar  MORADABAD  Excel
1  2020-09-28           Kumari Garima      DELHI  Excel
2  2020-09-28  Damarakeswar  Guddanti      ELURU  Excel
3  2020-09-28           Manish Bharti  BANGALORE  Excel
4  2020-09-28         Rakesh Tripathi       PUNE  Excel

In [66]:
df["City"].value_counts()

PUNE                            424
MUMBAI                          193
DELHI                           147
NEW DELHI                       117
BANGALORE                        93
                               ...
CLUJ-NAPOCA                       1
SOLAPUR                           1
LAS PIAS CITY, METRO MANILA      1
KOSI                              1
THIRUVALLA                        1
Name: City, Length: 740, dtype: int64

In [67]:
df['City']=df['City'].replace([','], ' ', regex=True)

In [68]:
df['City']=df['City'].replace(['-','/','CITY'], '', regex=True)

In [69]:
df['City']=df['City'].str.replace(r"\(.*\)","")

In [70]:
df['City']=df['City'].str.strip()

In [71]:
df['City']=df['City'].str.replace('\d+', '')

In [72]:
df['City']=df['City'].replace('NEW DELHI', 'DELHI', regex=True)

In [73]:
df['City']=df['City'].replace('DELHI', 'NEW DELHI', regex=True)

In [74]:
df['City'].unique()

array(['MORADABAD', 'NEW DELHI', 'ELURU', 'BANGALORE', 'PUNE',
       'SONEBHADRA', 'BHUBANESWAR', 'MUMBAI', 'SILCHAR', 'GURUGRAM',
       'FARIDABAD', 'BANGALORE SOUTH', 'BILASPUR', 'GOREGAON W  MUMBAI',
       'NEAR DIKSHANT INTERNATIONAL SCHOOL', 'TINSUKIA', 'NOIDA',
       'HYDERABAD', 'RANCHI', 'TUMKUR', 'UDAIPUR', 'GADARPUR', 'GUWAHATI',
       'SHAHADA', 'KASARAGOD', 'DURG', 'MOHALI', 'KOLKATA', 'KANPUR',
       'HISAR', 'NASHIK', 'AHMEDABAD', 'LUCKNOW', 'GHAZIABAD', 'PATNA',
       'MEERUT', 'ACCRA', 'TEMA', 'JALGAON', 'MALAPPURAM',
       'HISAR  HARYANA', 'GANGTOK', 'COOCHBIHAR', 'BIDAR', 'AMRITSAR',
       'MALOUT PUNJAB', 'GREATER NOIDA', 'VADODARA', 'SAHARANPUR',
       'KURUKSETHRA', 'SELANGOR', 'BENGALURU', 'INDORE',
       'DHARAMSHALA  HIMACHAL PRADESH.', 'TRIVANDRUM', 'WAI',
       'NAVI MUMBAI  ', 'RAIPUR', 'ANKOLA', 'MUDIPU', 'VISAKHAPATNAM',
       'MYSORE', 'GREATER NOIDA WEST', 'BODHAN', 'ANAND', 'THANE',
       'PUTTUR', 'DEWAS  MP', 'MADURAI  TAMIL NADU  INDIA',
       'ALIGARH  U.P.', 'CHENNAI', 'BHIWANDI', 'VIJAYAPUR',
       'NORTH WEST NEW DELHI', 'CHENGANNUR', 'DEHRADUN',
       'MUMBAI SUBURBAN', 'HARIDWAR', 'GURGAON', 'GAYA', 'KARNAL',
       'JAIPUR', 'AURANGABAD', 'GOALPARA', 'RATLAM', 'VALSAD',
       'MANDALUYONG', 'JAMMU', 'NIZAMABAD', 'KATHUA', 'DEWAS', 'BINGABON',
       'SAN JOSE DEL MONTE', 'KOHIMA', 'GWALIOR', 'BUXAR', 'GUNTUR',
       'KOLHAPUR', 'QUEZON', 'ACCRA  GHANA', 'KURUKSHETRA', 'MANDSAUR',
       'PASAY', 'MANILA PHILIPPINES', 'ARA', 'CALOOCAN', 'MARAMAG',
       'AURAIYA UTTAR PRADESH', 'KALABURAGI', 'MADINA',
       'LAS PIAS   METRO MANILA', 'BEED', 'WEST GODAVARI', 'MALEGAON',
       'NAVI MUMBAI', 'VISHAKHAPATTANAM', 'DHAKA', 'CHANDIGARH',
       'KHATIMA', 'SUCHITRA', 'CAINTA RIZAL', 'NAVI MUMBAI  NEW PANVEL',
       'CAVITE', 'BHUSAWAL', 'BUSTOS BULACAN', 'ILOILO', 'PALAMPUR',
       'ERNAKULAM', 'SILANG', 'MUKTESHWAR', 'FREDERICK', 'COIMBATORE',
       'BHOPAL', 'RIYADH', 'BACOLOD', 'NAGPUR', 'MELBOURNE', 'PANIPAT',
       'GENERAL TRIAS', 'DASMARIAS', 'PHILIPPINES', 'ZARIA', 'HARARE',
       'BURHANPUR', 'MAL', 'KAKINADA', 'MAL  MALDIVES', 'SANGAREDDY',
       'LATUR', 'ISTANBUL  TURKEY', 'MANCHER  PUNE', 'JORHAT  ASSAM',
       'LAGOS', 'PRETORIA', 'GOKUL VIHAR MORADABAD', 'CAGAYAN DE ORO',
       'JAKARTA', 'TARLAC', 'WARDHA', 'BOKARO STEEL', 'CALABAR',
       'KARIMNAGAR', 'IBADAN', 'ATHENS', 'LONDON ON', 'MUNTINLUPA',
       'GRESIK', 'NEW DELHI  INDIA', 'KHANDWA  MP', 'PANCHKULA',
       'CAVITE  PHILIPPINES', 'BACOOR  PHILIPPINES',
       'IMUS  CAVITE  PHILIPPINES', 'IMUS   CAVITE  PHILIPPINES', 'IMUS',
       'JAMSHEDPUR', 'LOHARDAGA', 'YOBE', 'BHILAI', 'UTTARAKHAND',
       'HYDERABA', 'NAGDA', 'MARRAKECH', 'OTON ILOILO',
       'SURABAYA  INDONESIA', 'FARRUKHABAD UP', 'CLUJNAPOCA', 'HOUSTON',
       'RATNAGIRI', 'SURAT', 'SURIGAO', 'EDMONTON',
       'SURIGAO   PHILIPPINES', 'MORADABAD  UTTAR PRADESH', 'NALLASOPARA',
       'BANDUNG', 'KOTA BANDUNG', 'HARDA', 'SIWAN', 'SRINAGAR',
       'ERODE  TAMILNADU', 'JALANDHAR', 'ROBERTSGANJ', 'ROORKEE',
       'JODHPUR', 'SILIGURI', 'VARANASI', 'BALLIA', 'KOLLAM',
       'PATNA   BIHAR', 'BARY', 'DUBLIN', 'MIRI', 'BANGLORE', 'ALIGARH',
       'KANNUR', 'KOTTAYAM', 'THRISSUR', 'GOA', 'ALAPPEY', 'KOZHIKODE',
       'BEKASI  INDONESIA', 'JAITU', 'GONDA', 'SAMARINDA',
       'CHABUA  DIBRUGARH', 'NIGERIA  KATSINA', 'LUDHIANA', 'KARACHI',
       'VRINDAVAN', 'TAGUIG', 'COCHIN', 'ANKLESHWAR', 'AJMER',
       'JOHANNESBURG', 'VISAKHAPATNAM  ANDHRA PRADESH  INDIA', 'ASSAM',
       'JAUNPUR', 'LONI ', 'KARNAL  HARYANA', 'GOMBE  NIGERIA', 'MANJERI',
       'DUMKA', 'ROHTAK', 'KUALA LUMPUR', 'CASABLANCA', 'JALORE',
       'BACOOR', 'MAPUSA', 'NUH', 'JHAJJAR', 'KARACHI PAKISTAN',
       'VIZIANAGARAM', 'LEBANONSAIDA', 'ANSAN', 'THIRUVALLA', 'NADIAD',
       'UAE', 'PURI', 'GUJARAT', 'SUNSET AVE  WINDSOR', 'MALAYSIA',
       'RAEBARELI', 'JABALPUR', 'JORHAT', 'CHAMARAJNAGAR',
       'KHARGHAR  NAVI MUMBAI  ', 'REWARI', 'AHMEDNAGAR', 'RUPNAGAR',
       'MADHYA PRADESH', 'KALYAN', 'SUNYANI', 'MADURAI', 'UJJAIN',
       'GURGOAN', 'TEZPUR', 'KOCHI', 'GANDHINAGAR', 'LUSAKA', 'AURAGABAD',
       'JALNA', 'AKOLA', 'DEULGAON RAJA BULDANA', 'BULDHANA', 'CALICUT',
       'SHIMLA', 'BALLABGARH', 'GURGRAM', 'HARYANA', 'KOSI', 'RAJAM',
       'SALEM', 'PALANPUR', 'PIMPARI CHINCHWAD', 'NANDED', 'HINGOLI',
       'HALDWANI', 'PIMPLE SAUDAGAR', 'NAKONDE', 'MORIGAON',
       'NAGPUR MAHARASHTRA', 'KATNI', 'PARLI', 'AHMEDABAD  GUJARAT',
       'DIMAPUR', 'PATHALGAON', 'SUDERSHAN PARK NEW DELHI', 'CIRIMIRI',
       'TULJAPUR', 'LUNAWADA', 'LATUR MAHARASHTRA', 'REWA', 'BIHARSHARIF',
       'V.P.O  MOHANPUR  DISTT.  REWARI', 'KHAMBHAT', 'SHANI SHINGNAPUR',
       'SAIDA', 'KARAULI', 'NEW DELHI NCR', 'AMRAVATI  MAHARASHTRA',
       'SECUNDERABAD', 'VIZAG', 'NASIK', 'RAJKOT', 'AHAMDNAGAR',
       'KOLDING', 'WASHI', 'GODHARA', 'SRIMADHOPUR', 'ALLAHABAD',
       'BOISAR', 'KONDAGAON', 'NAGAON  ASSAM.', 'SINGAPORE', 'M',
       'MALEGAON  NASHIK', 'SULTANPUR', 'ICHALKARANJI', 'SILCHAR  ASSAM',
       'GORAKHPUR', 'JAMNAGAR', 'SOLAPUR', 'ARIYALUR', 'PRAYAGRAJ',
       'TRIPUNITHURA  ERNAKULAM', 'KOZHIKKODE', 'TRIVANDRUM  KERALA',
       'KALADY', 'BELAGAVI', 'NANGALIYA GUJARWAS', 'ROURKELA', 'PHALTAN',
       'PILANI', 'CHAPRA', 'SURJAPUR', 'SAMASTIPUR', 'VIJAYAWADA',
       'HOSUR', 'BAREILLY', 'JAJPUR', 'VIJAYPUR', 'INKOLLU', 'SHADNAGAR',
       'RAYAGADA  ODISHA.', 'YAMUNANAGAR', 'VISHAKHAPATNAM',
       'THANE MAHARASHTRA', 'ASANSOL', 'AIROLI', 'ISLAMPUR', 'HAPUR',
       'SANCHI', 'WARANGAL', 'BIHAR', 'ITANAGAR', 'BHAGALPUR', 'NELLORE',
       'PARBHANI', 'EGYPT  DAMIETTA', 'BALER AURORA PHILIPPINES',
       'MANGLORE', 'PALAKKAD', 'PASIGHAT', 'PARASI', 'AMBEJOGAI',
       'HOSHANGABAD M.P.', 'MANIPAL', 'DIBRUGARH', 'ALIBAG',
       'LOS BAOS  PHILIPPINES', 'PUSAD', 'IMPHAL', 'BIKRAMGANJ', 'ARWAL',
       'SASARAM', 'DARBHANGA', 'KHORDHA', 'JEHANABAD', 'SHAMLI U.P.',
       'ANANTHAPUR', 'PASIG', 'MANILA', 'KALYANDOMBIVALI', 'SAN CARLOS',
       'MANILA  PHILIPPINES', 'SRI GANGANAGAR', 'KUPPAM', 'KOTA',
       'BARAMATI', 'KOLKATA WEST BENGAL', 'DHANBAD', 'DUBAI',
       'GHAZIYABAD Q', 'VELLORE', 'PORBANDAR', 'KANGRA', 'NEEMUCH',
       'BEGUSARAI', 'THALASSERY', 'PUNE  MAHARASHTRA', 'NAWANSHAHR',
       'I WANT TO ATTEND', 'FARIDABAD  HARYANA', 'AGRA', 'BRUSSELS',
       'GONDIA', 'VASHI  NAVI MUMBAI', 'NEW DELHINCR', 'WEST NEW DELHI',
       'BHILWARA', 'NCR', 'BHUBANESWAR PATNA', 'MAIHAR', 'PATNA  BIHAR',
       'DOHA', 'PATIALA', 'NEW DELHI.', 'BONGAIGAON',
       'SOUTH WEST NEW DELHI', 'MOTIHARI', 'MP', 'MURADNAGAR',
       'MANGALDAI', 'SECUDERABAD', 'NAINITAL', 'NOTTINGHAM UK', 'AYODHYA',
       'LEH', 'SHILLONG', 'GOA.', 'KALYANI', 'RAJABALA', 'GUMLA',
       'CHITTORGARH', 'SULLURPETA', 'GAYA  BIHAR', 'UMSAWNONGBRI',
       'CHATTOGRAM  BANGLADESH', 'TURA', 'RAJNANDGAON',
       'THUMMALAGUNTA TIRUPATI', 'SAGAR', 'CHITTAGONG', 'YAVATMAL',
       '', 'ESTERO', 'THRISSUR  KERALA', 'JHARAKHAND', 'MANSA',
       'JAMMU AND KASHMIR', 'AMRAVATI', 'MARGAOGOA',
       'ORAGITOK ROMBA ADING', 'CHINCHWAD', 'SARAN', 'GANDHIDHAM',
       'KARBI ANGLONG', 'LONAVALA', 'SATARA', 'SAHARANPUR  UP', 'MUNGER',
       'THANE WEST MUMBAI', 'PIMPRI CHINCHWAD', 'TIRUPATHI',
       'HOSHANGABAD', 'SANGLI', 'NEWNEW DELHI', 'AIZAWL', 'MATHURA',
       'BASTAR CHHATTISGARH', 'PANAJI', 'VASCO', 'RUCHITAMAGR@GMAIL.COM',
       'NAIROBI', 'BELTOLA  GUWAHATI', 'KESINGA', 'BARIPADA  MAYURBHANJ',
       'THANE WEST', 'NAGOTHANE', 'OSMANABAD', 'BHIWADI', 'SONBHADRA',
       'DHARMAPURI', 'MADHUBANI', 'KHARGHAR', 'AGRA  UTTAR PRADESH',
       'TALASARI', 'KOLLATA', 'SHAHDARA  NORTH EAST NEW DELHI', 'BARGARH',
       'NEW DELHILUCKNOW', 'KOTTAYAM  KERALA', 'BHUBANESHWAR',
       'MANGALORE', 'GANDEVI', 'JHUNJHUNU', 'KAMPALA  UGANDA',
       'PATHANAMTHITTA', 'SIVASAGAR', 'WINDHOEK', 'DHULE',
       'HARYANA  NEW DELHI', 'RAJASTHAN', 'AZAMGARH U.P',
       'CHITTARANJAN WEST BENGAL', 'SASASARAM', 'MANAPPARAI',
       'VELACHERY  CHENNAI', 'AMBAJOGAI', 'AMBIKAPUR', 'ALGIERS',
       'LAHORE', 'BHUBANESWAR ODISHA', 'KAMRUP METRO', 'DIGBOI', 'JIND',
       'HOOGHLY', 'WASHIM', 'THENI', 'JAMNAGAR  GUJARAT',
       'KARACHI  PAKISTAN', 'WEST BENGAL', 'CHHATARPUR', 'TAMILNADU',
       'SATNA', 'SOFADES', 'NEWCASTLE', 'RAICHUR', 'GADAG', 'GUAGUA',
       'TIRUCHIRAPPALLI', 'MUMBAILUCKNOW', 'LAKHIMPUR KHERI', 'MYSURU',
       'BALANGIR  ODISHA', 'KADAPA', 'BATHINDA', 'QUEZON  PHILIPPINES',
       'DHARAMSHALA', 'DAVAO', 'SHAHJAHANPUR UP', 'BAGUIO', 'MANCHERIAL',
       'VALENCIA   BUKIDNON', 'VELLORR TAMILNADU', 'KORBA', 'BILASIPARA',
       'KATIHAR', 'KOLAR', 'JANJGIR', 'NALBARI', 'KARKALA', 'TIRUVALLA',
       'DHENKANAL', 'CHHAPRA', 'DEHRADOON', 'ALAPPUZHA', 'KUCHAMAN',
       'BANKURA', 'HANDEWADI ROAD', 'UDAIPUR  TRIPURA', 'VISHAKAPATNAM',
       'GOLAGHAT', 'ODISHA', 'BHARATPUR', 'SIBSAGAR', 'BURDWAN',
       'BAIDYAPUR  BURDWAN', 'KORAPUT', 'KOPARGOAN', 'GANGAPUR',
       'HAJIPUR', 'DURGAPUR', 'TEZPUR  ASSAM', 'BALLARI', 'GOHPUR',
       'JHANSI', 'PACHORA', 'GUWAE', 'KEKRI', 'WANWARLA  PUSAD',
       'YAVATAMAL', 'MALKAPUR', 'SHIRDI', 'TEZPUR   ASSAM', 'WANI',
       'ARJUNI', 'GUWAHATI  ASSAM', 'MUJAFFARPUR', 'BIJNI', 'YAVTMAL',
       'NAGAON', 'CHIKARADA', 'AURANGABAD  BIHAR', 'KARAD', 'DAPOLI',
       'VISAKHAPTNAM', 'KERALA', 'BARELI   DISTT RAISEN', 'HAFLONG',
       'BULANDSHAHR', 'BONGAIGAON  ASSAM', 'NAGERCOIL', 'SHEOGANJ',
       'MOODBIDRE', 'JODHPUR RAJASTHAN', 'JAGDALPUR BASTER', 'JEYPORE',
       'CHAKDAHA', 'MUZZAFURPUR', 'HARDOI', 'RASRA', 'MUZAFFARPUR',
       'RAYAGADA', 'BARH', 'NASRIGANJ', 'UDUPI', 'SITAMARHI', 'MADHUBAN',
       'SAMASTIP', 'BALURGHAT SOUTH DINAJPUR', 'GOPALGANJ', 'SANTRAMPUR',
       'SAHIBGANJ', 'BEAWAR', 'KANCHIPURAM', 'AMBUR', 'ERODE',
       'KHARIAR ROAD', 'JALGAON JAMOD', 'LADAKH', 'TIRUPATI', 'MUSCAT',
       'MUNGER BIHAR', 'AGARTALA', 'KONDAPALLI'], dtype=object)

In [75]:
df["City"].value_counts()

PUNE                        449
NEW DELHI                   282
MUMBAI                      217
BANGALORE                   106
CHENNAI                      92
                           ...
NIGERIA  KATSINA              1
SHEOGANJ                      1
GANGAPUR                      1
LAS PIAS   METRO MANILA      1
THIRUVALLA                    1
Name: City, Length: 657, dtype: int64

In [79]:
df.to_excel(r"C:\Users\user\Downloads\4.MKR TASK 2\New folder\COMPLETE.xlsx")